[{"id": 2, "name": "Pizza Margherita", "ingredients": "pizza dough, fresh mozzarella cheese, tomato sauce, fresh basil leaves, olive oil", "steps": "At least 30 minutes before you plan to bake your pizza, preheat the oven to 450° Fahrenheit (232°C). If you have one, place a pizza steel or pizza stone into the oven before preheating. Personally, we use a higher temperature, see the tips section for our thoughts on what temperature is best for baking pizza at home.\n\nIf your pizza dough is cold, allow it to warm at room temperature for 20 to 30 minutes.\n\nWhile the oven preheats, make the sauce. In a bowl, crush the tomatoes with the olive oil and a pinch of salt. Taste, and then season with more salt as necessary.\n\n\nWhen ready to bake your pizza, prepare a pizza peel or pizza pan by dusting it with semolina flour.\n\nDust a clean work surface with all-purpose flour, and then form your pizza dough into a round, large enough to fit your pizza peel or pan. To stretch the dough, avoid rolling it out, as this can flatten the bubbles that have formed. Instead, use your fingers to make dimples in the dough, starting from the center and working outwards. Carefully stretch and push the dough to fit your pizza pan or peel. Use a light touch to maintain as many air pockets in the dough as possible.\n\nTransfer the dough round to your pizza peel or pan, and reform it if it shrinks back a bit.\n\nSpread a light layer of pizza sauce over the pizza, leaving a thin edge untouched for the crust. Scatter the cheese and basil over the sauce.\n\nBake until the crust is set and golden brown and the cheese has melted with golden spots all over, 6 to 15 minutes, depending on oven temperature. Remove from the oven, scatter over some more fresh basil, cut, and serve.", "imageUrl": "https://images.unsplash.com/photo-1506354666786-959d6d497f1a?w=1920&q=80"}, {"id": 3, "name": "Pizza Hawaii", "ingredients": "1 lb pizza dough (homemade or store-bought)\n1 tbsp olive oil\n1/2 cup pizza sauce\nCornmeal (for the pizza pan/stone) \n\n1.5 - 2 cups shredded mozzarella cheese\n1/2 cup cooked ham or Canadian bacon, diced or sliced\n1/2 cup pineapple chunks (fresh or canned, well-drained)\nOptional: 3-4 slices bacon, cooked and crumbled (for extra smoky flavor)\nOptional: Red pepper flakes or dried oregano", "steps": "Preheat Oven: Preheat your oven to its highest setting, usually between 450°F - 500°F (230°C - 260°C). If using a pizza stone, place it in the oven while it heats.\nPrepare Dough: On a lightly floured surface, roll or stretch the pizza dough into a 12-inch circle.\nAssemble: Transfer the dough to a pizza pan or peel sprinkled with cornmeal. Spread the pizza sauce evenly, leaving a 1-inch border for the crust.\nAdd Toppings: Sprinkle with mozzarella cheese, then top with ham, pineapple, and optional bacon.\nBake: Bake for 10-15 minutes, or until the crust is golden brown and the cheese is bubbly and slightly charred.\nServe: Let the pizza rest for 5 minutes before slicing.", "imageUrl": "https://images.unsplash.com/photo-1565299624946-b28f40a0ae38"}, {"id": 4, "name": "Caesar Salad", "ingredients": "romaine lettuce\nparmesan cheese\ncroutons\nCaesar dressing\nlemon juice\nblack pepper\ngarlic\nanchovies\nolive oil", "steps": "Wash and chop romaine lettuce into bite-sized pieces\nToast bread cubes with olive oil and garlic to make croutons\nGrate fresh parmesan cheese\nMix Caesar dressing with lemon juice\nToss lettuce with dressing\nTop with croutons and parmesan\nAdd freshly ground black pepper\nServe immediately", "imageUrl": "https://images.unsplash.com/photo-1546793665-c74683f339c1"}, {"id": 5, "name": "Tomato Basil Soup", "ingredients": "fresh tomatoes\nonion\ngarlic\nfresh basil\nvegetable broth\nheavy cream\nolive oil\nsalt\npepper\nsugar", "steps": "Dice onions and mince garlic\nHeat olive oil in a large pot\nSauté onions until translucent\nAdd garlic and cook for 1 minute\nAdd chopped tomatoes and vegetable broth\nSimmer for 20 minutes\nAdd fresh basil leaves\nBlend until smooth using immersion blender\nStir in heavy cream\nSeason with salt, pepper, and a pinch of sugar\nServe hot with fresh basil on top", "imageUrl": "https://images.unsplash.com/photo-1547592166-23ac45744acd"}]